require_relative "test_helper"

class ComplexTest < Test::Unit::TestCase

  ### def setup ... end だと失敗するのだけれど、なんでだっけ？
  a = NumRu::NArray.complex(4,1).indgen!.sbt!(-1) + Complex(0,0.25)
  b = NumRu::NArray.complex(1,3).indgen!.add!(-0.5).mul!(Complex(0,0.5))

  test "complex: a, b" do
    assert { a == NArray[ [  1.0 + 0.25i, 2.0 + 0.25i, 3.0 + 0.25i, 4.0 + 0.25i ] ] }
    assert { b == NArray[ [ -0.0 - 0.25i ], [ 0.0 + 0.25i ], [ 0.0 + 0.75i ] ] }
  end

  test "complex: a + b" do
    assert { a + b == NArray[
      [ 1.0+0.0i, 2.0+0.0i, 3.0+0.0i, 4.0+0.0i ],
      [ 1.0+0.5i, 2.0+0.5i, 3.0+0.5i, 4.0+0.5i ],
      [ 1.0+1.0i, 2.0+1.0i, 3.0+1.0i, 4.0+1.0i ] ] }
  end

  test "complex: a - b" do
    assert { a - b == NArray[
      [ 1.0+0.5i, 2.0+0.5i, 3.0+0.5i, 4.0+0.5i ],
      [ 1.0+0.0i, 2.0+0.0i, 3.0+0.0i, 4.0+0.0i ],
      [ 1.0-0.5i, 2.0-0.5i, 3.0-0.5i, 4.0-0.5i ] ] }
  end

  test "complex: a * b" do
    assert { a * b == NArray[
      [ 0.0625-0.25i, 0.0625-0.5i, 0.0625-0.75i, 0.0625-1.0i ],
      [ -0.0625+0.25i, -0.0625+0.5i, -0.0625+0.75i, -0.0625+1.0i ],
      [ -0.1875+0.75i, -0.1875+1.5i, -0.1875+2.25i, -0.1875+3.0i ] ] }
  end

  test "complex: a / b" do
    assert { a / b == NArray[
      [ -1.0+4.0i, -1.0+8.0i, -1.0+12.0i, -1.0+16.0i ],
      [ 1.0-4.0i, 1.0-8.0i, 1.0-12.0i, 1.0-16.0i ],
      [ 1/3.0 -(4i/3.0), 1/3.0 - (8i/3.0), (1/3.0) - 4.0i, (1/3.0) - (16i/3.0) ] ]}
  end

  test "complex: a**b"  do
    assert { a**b == NArray[
      [ 1.063128473987616 - 0.008056624433607445i, 1.0157808945220865 - 0.17983432994931914i,
        0.9824950646493582 - 0.2777592852726935i, 0.955165844881838 - 0.34548478040960934i ],
      [ 0.9405660729663604 + 0.007127819252606392i, 0.9545456352055827 + 0.1689932106805447i,
        0.9424894301166433 + 0.26644936947311315i, 0.9258160640383039 + 0.3348689249075181i],
      [ 0.8319420913815189 + 0.0189168246353273i, 0.7879595278749634 + 0.4571120007233632i,
        0.6364636082877269 + 0.6911333503356839i, 0.4820944532503636 + 0.8235327514966119i] ] }
  end

  test "complex: Re(a)"  do
    assert { a.real == NArray[ [ 1.0, 2.0, 3.0, 4.0 ] ] }
  end

  test "complex: Im(a)"  do
    assert { a.imag == NArray[ [ 0.25, 0.25, 0.25, 0.25 ] ] }
  end

  test "complex: arg(a)"  do
    assert { a.angle == NArray[ [ 0.24497866312686414,
                                  0.12435499454676144,
                                  0.08314123188844123,
                                  0.06241880999595735 ] ] }
  end

  test "complex: conjugate(a)"  do
    assert { a.conj == NArray[[ 1.0-0.25i, 2.0-0.25i, 3.0-0.25i, 4.0-0.25i]] }
  end

end
